#include <iostream>
using namespace std;
int main() {
	//1 Дано расстояние L в сантиметрах. Используя операцию деления нацело, найти количество полных метров в нем(1 метр = 100 см).
	//int l, meters;
	//cin >> l;
	//meters = l / 100;
	//cout << meters << endl;
	//2 Дана масса M в килограммах. Используя операцию деления нацело, найти количество полных тонн в ней(1 тонна = 1000 кг)
	//int l, tonna;
	//cin >> l;
	//tonna = l / 1000;
	//cout << tonna << endl;
	//3  Дан размер файла в байтах. Используя операцию деления нацело, найти количество полных килобайтов, которые занимает данный файл(1 килобайт = 1024 байта).
	//int l, bit;
	//cin >> l;
	//bit = l / 1024;
	//cout << bit << endl;
	//4  Даны целые положительные числа A и B (A > B). На отрезке длины A размещено максимально возможное количество отрезков длины B(без наложений).Используя операцию деления нацело, найти количество отрезков B, размещенных на отрезке A.
	//int A, B, N;
	//cin >> A >> B;
	//N = A / B;
	//cout << N << endl;
	//5 Даны целые положительные числа A и B (A > B). На отрезке длины A размещено максимально возможное количество отрезков длины B(без наложений).Используя операцию взятия остатка от деления нацело, найти длину незанятой части отрезка A.
	//int A, B;
	//cin >> A >> B;
	//double C;
	//C = A % B;
	//cout << C << endl;
	//6 Дано двузначное число. Вывести вначале его левую цифру (десятки), а затем — его правую цифру (единицы). Для нахождения десятков использовать операцию деления нацело, для нахождения единиц — операцию взятия остатка от деления.
	//int num;
	//cin >> num;
	//int d = num / 10;
	//int e = num % 10;
	//cout << d << " " << e << endl;
	//7 Дано двузначное число. Найти сумму и произведение его цифр.
	//int num;
	//cin >> num;
	//int a = num / 10;
	//int b = num % 10;
	//int c = a + b;
	//int d = a * b;
	//cout << c << endl;
	//cout << d << endl;
	//8 Дано двузначное число. Вывести число, полученное при перестановке цифр исходного числа.
	//int num;
	//cin >> num;
	//int a = num / 10;
	//int b = num % 10;
	//int c = b * 10 + a;
	//cout << c << endl;
	//9 Дано трехзначное число. Используя одну операцию деления нацело, вывести первую цифру данного числа(сотни).
	//int num;
	//cin >> num;
	//int a = num / 100;
	//cout << a << endl;
	//10  Дано трехзначное число. Вывести вначале его последнюю цифру(единицы), а затем — его среднюю цифру(десятки).
	//int num;
	//cin >> num;
	//int a = num % 10;
	//int b = num / 10;
	//int c = b % 10;
	//cout << a << endl;
	//cout << c << endl;
	//11 Дано трехзначное число. Найти сумму и произведение его цифр.
	//int num;
	//cin >> num;
	//int a = num / 100;
	//int b = num / 10;
	//int c = b % 10;
	//int d = num % 10;
	//int l = a + c + d;
	//int k = a * c * d;
	//cout << l << endl;
	//cout << k << endl;
	//12 Дано трехзначное число. Вывести число, полученное при прочтении исходного числа справа налево.
	//int num;
	//cin >> num;
	//int a = num / 100;
	//int B = num / 10;
	//int c = B % 10;
	//int d = num % 10;
	//int L = (d * 100) + (c * 10) + a;
	//cout << L << endl;
	//13 Дано трехзначное число. В нем зачеркнули первую слева цифру и приписали ее справа.Вывести полученное число.
	int num;
	cin >> num;
	int a = num % 100;
	int b = 10 * a;
	int c = num / 100;
	int d = b + c;
	int n = 
	cout << b << endl;
	cout << c << endl;
	//14
}